#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline author:t broken-links:nil
#+options: c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t title:t toc:t
#+options: todo:t |:t
#+title: Kubernetes-the-hard-way
#+date: <2020-01-29 Wed>
#+author: Gregory Grubbs
#+email: gregory@dynapse.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.0.60 (Org mode 9.3.1)
#+setupfile: https://raw.githubusercontent.com/fniessen/org-html-themes/master/setup/theme-readtheorg.setup
#+PROPERTY: header-args:sh :comments org :shebang #!/usr/bin/env bash :tangle no
*** Verification
    :PROPERTIES:
    :CUSTOM_ID: verification
    :END:

Verify =cfssl= and =cfssljson= version 1.3.4 or higher is installed:

#+begin_src sh :session k-sh :results output replace
  cfssl version
#+end_src

#+RESULTS:
: Version: 1.4.1
: Runtime: go1.13.4

#+begin_quote
  output
#+end_quote

#+begin_example
  Version: 1.3.4
  Revision: dev
  Runtime: go1.13
#+end_example

#+begin_src sh :session k-sh :results output replace
  cfssljson --version
#+end_src

#+RESULTS:
: Version: 1.4.1
: Runtime: go1.13.4

#+begin_example
  Version: 1.3.4
  Revision: dev
  Runtime: go1.13
#+end_example

*** Verification
    :PROPERTIES:
    :CUSTOM_ID: verification-1
    :END:

Verify =kubectl= version 1.15.3 or higher is installed:

#+begin_src sh :session k-sh :results output replace
  kubectl version --client --short
#+end_src

#+RESULTS:
: Client Version: v1.16.2

#+begin_quote
  output
#+end_quote

#+begin_example
  Client Version: v1.15.3
#+end_example

Next: [[file:03-compute-resources.md][Provisioning Compute Resources]]
* Provisioning Compute Resources
  :PROPERTIES:
  :CUSTOM_ID: provisioning-compute-resources
  :END:

Kubernetes requires a set of machines to host the Kubernetes control plane and the worker nodes where containers are ultimately run. In this lab you will provision the compute resources required for running a secure and highly available Kubernetes cluster across a single [[https://cloud.google.com/compute/docs/regions-zones/regions-zones][compute zone]].

#+begin_quote
  Ensure a default compute zone and region have been set as described in the [[file:01-prerequisites.md#set-a-default-compute-region-and-zone][Prerequisites]] lab.
#+end_quote
#+begin_src sh :session k-sh :results output replace
gcloud config list
#+end_src

#+RESULTS:
: [compute]
: region = us-west2
: zone = us-west2-c
: [core]
: account = ggrubbs@mesosphere.io
: disable_usage_reporting = True
: project = konvoy-gcp-se
: 
: Your active configuration is: [default]


**** Create a firewall rule that allows external SSH, ICMP, and HTTPS:

#+begin_src sh :session k-sh :results none :tangle cluster-setup/bin/01-provision-gcp.sh
  gcloud compute firewall-rules create kubernetes-the-hard-way-allow-external \
    --allow tcp:22,tcp:6443,icmp \
    --network kubernetes-the-hard-way \
    --source-ranges 0.0.0.0/0
#+end_src

#+begin_quote
  An [[https://cloud.google.com/compute/docs/load-balancing/network/][external load balancer]] will be used to expose the Kubernetes API Servers to remote clients.
#+end_quote

List the firewall rules in the =kubernetes-the-hard-way= VPC network:

#+begin_src sh :session k-sh :results output replace 
  gcloud compute firewall-rules list --filter="network:kubernetes-the-hard-way"
#+end_src

#+RESULTS:
: NAME                                    NETWORK                  DIRECTION  PRIORITY  ALLOW                 DENY  DISABLED
: kubernetes-the-hard-way-allow-external  kubernetes-the-hard-way  INGRESS    1000      tcp:22,tcp:6443,icmp        False
: kubernetes-the-hard-way-allow-internal  kubernetes-the-hard-way  INGRESS    1000      tcp,udp,icmp                False
: 
: To show all fields of the firewall, please show in JSON format: --format=json
: To show all fields in table format, please see the examples in --help.
NAME                                    NETWORK                  DIRECTION  PRIORITY  ALLOW                 DENY  DISABLED
kubernetes-the-hard-way-allow-external  kubernetes-the-hard-way  INGRESS    1000      tcp:22,tcp:6443,icmp        False
kubernetes-the-hard-way-allow-internal  kubernetes-the-hard-way  INGRESS    1000      tcp,udp,icmp                False

To show all fields of the firewall, please show in JSON format: --format=json
To show all fields in table format, please see the examples in --help.

#+begin_quote
  output
#+end_quote

#+begin_example
  NAME                                    NETWORK                  DIRECTION  PRIORITY  ALLOW                 DENY
  kubernetes-the-hard-way-allow-external  kubernetes-the-hard-way  INGRESS    1000      tcp:22,tcp:6443,icmp
  kubernetes-the-hard-way-allow-internal  kubernetes-the-hard-way  INGRESS    1000      tcp,udp,icmp
#+end_example

**** Allocate a static IP address that will be attached to the external load balancer fronting the Kubernetes API Servers:

#+begin_src sh :session k-sh :results none :tangle cluster-setup/bin/01-provision-gcp.sh
  gcloud compute addresses create kubernetes-the-hard-way \
    --region $(gcloud config get-value compute/region)
#+end_src

Verify the =kubernetes-the-hard-way= static IP address was created in your default compute region:

#+begin_src sh :session k-sh :results output replace
  gcloud compute addresses list --filter="name=('kubernetes-the-hard-way')"
#+end_src

#+RESULTS:
: NAME                     ADDRESS/RANGE  TYPE      PURPOSE  NETWORK  REGION    SUBNET  STATUS
: kubernetes-the-hard-way  34.94.97.101   EXTERNAL                    us-west2          RESERVED

#+begin_quote
  output
#+end_quote

#+begin_example
  NAME                     REGION    ADDRESS        STATUS
  kubernetes-the-hard-way  us-west1  XX.XXX.XXX.XX  RESERVED
#+end_example

**** Create three compute instances which will host the Kubernetes control plane:
#+begin_src sh :session k-sh :results none :tangle cluster-setup/bin/01-provision-gcp.sh
CONTROL_INSTANCE_TYPE=n1-standard-4
  for i in 0 1 2; do
    gcloud compute instances create gg-controller-${i} \
      --async \
	  --no-address \
      --boot-disk-size 200GB \
      --can-ip-forward \
      --image-family ubuntu-1804-lts \
      --image-project ubuntu-os-cloud \
      --machine-type ${CONTROL_INSTANCE_TYPE} \
      --private-network-ip 10.240.0.1${i} \
      --scopes compute-rw,storage-ro,service-management,service-control,logging-write,monitoring \
      --subnet kubernetes \
      --tags kubernetes-the-hard-way,controller \
	  --labels owner=ggrubbs,expiration=48h
  done
#+end_src

List the create controller instances
#+begin_src sh :session k-sh :results table replace
gcloud compute instances list --filter="tags.items=kubernetes-the-hard-way AND tags.items=controller"
#+end_src

#+RESULTS:
| NAME            | ZONE       | MACHINE_TYPE  | PREEMPTIBLE |   INTERNAL_IP | EXTERNAL_IP | STATUS |
| gg-controller-0 | us-west2-c | n1-standard-4 | 10.240.0.10 |  34.94.56.188 | RUNNING     |        |
| gg-controller-1 | us-west2-c | n1-standard-4 | 10.240.0.11 | 34.94.182.163 | RUNNING     |        |
| gg-controller-2 | us-west2-c | n1-standard-4 | 10.240.0.12 |  35.235.77.77 | RUNNING     |        |

**** Create ${NUM_WORKERS} compute instances which will host the Kubernetes worker nodes:
#+begin_src sh :session k-sh :results none :tangle cluster-setup/bin/01-provision-gcp.sh
  WORKER_INSTANCE_TYPE=n1-standard-8
  NUM_WORKERS=6
	for i in $(seq 0 $((${NUM_WORKERS} - 1))) ; do
	# for i in 0 1 2; do
	  gcloud compute instances create gg-worker-${i} \
		--async \
		--no-address \
		--boot-disk-size 200GB \
		--can-ip-forward \
		--image-family ubuntu-1804-lts \
		--image-project ubuntu-os-cloud \
		--machine-type ${WORKER_INSTANCE_TYPE} \
		--metadata pod-cidr=10.200.${i}.0/24 \
		--private-network-ip 10.240.0.2${i} \
		--scopes compute-rw,storage-ro,service-management,service-control,logging-write,monitoring \
		--subnet kubernetes \
		--tags kubernetes-the-hard-way,worker \
		--labels owner=ggrubbs,expiration=48h
	done
#+end_src

#+RESULTS:
#+begin_example

▶  ~ ❯ projects ❯ … ❯ docs ▶  gregoryg ▶ $ ▶ > > > > > > > > > > > > > > NOTE: The users will be charged for public IPs when VMs are created.
Instance creation in progress for [gg-worker-0]: https://www.googleapis.com/compute/v1/projects/konvoy-gcp-se/zones/us-west2-c/operations/operation-1580347403479-59d514d9b2b14-47b5eb0d-04d928f3
Use [gcloud compute operations describe URI] command to check the status of the operation(s).
NOTE: The users will be charged for public IPs when VMs are created.
Instance creation in progress for [gg-worker-1]: https://www.googleapis.com/compute/v1/projects/konvoy-gcp-se/zones/us-west2-c/operations/operation-1580347406920-59d514dcfac59-892dfeed-90ace76a
Use [gcloud compute operations describe URI] command to check the status of the operation(s).
NOTE: The users will be charged for public IPs when VMs are created.
Instance creation in progress for [gg-worker-2]: https://www.googleapis.com/compute/v1/projects/konvoy-gcp-se/zones/us-west2-c/operations/operation-1580347410170-59d514e014220-3c02d392-56469a79
Use [gcloud compute operations describe URI] command to check the status of the operation(s).
#+end_example

List the created worker instances
#+begin_src sh :session k-sh :results table replace
gcloud compute instances list --filter="tags.items=kubernetes-the-hard-way AND tags.items=worker"
#+end_src

#+RESULTS:
| NAME        | ZONE       | MACHINE_TYPE  | PREEMPTIBLE |   INTERNAL_IP | EXTERNAL_IP | STATUS |
| gg-worker-0 | us-west2-c | n1-standard-8 | 10.240.0.20 |  35.236.1.139 | RUNNING     |        |
| gg-worker-1 | us-west2-c | n1-standard-8 | 10.240.0.21 | 35.236.93.211 | RUNNING     |        |
| gg-worker-2 | us-west2-c | n1-standard-8 | 10.240.0.22 | 34.94.175.154 | RUNNING     |        |
| gg-worker-3 | us-west2-c | n1-standard-8 | 10.240.0.23 |  34.94.206.98 | RUNNING     |        |
| gg-worker-4 | us-west2-c | n1-standard-8 | 10.240.0.24 | 35.236.113.11 | RUNNING     |        |
| gg-worker-5 | us-west2-c | n1-standard-8 | 10.240.0.25 |  34.94.241.86 | RUNNING     |        |

*** Verification
    :PROPERTIES:
    :CUSTOM_ID: verification
    :END:

List the compute instances in your default compute zone:

#+begin_src sh :session k-sh :results output replace
  gcloud compute instances list --filter="tags:kubernetes-the-hard-way"
  gcloud compute instances list --filter="tags.items=kubernetes-the-hard-way AND tags.items=controller" --format="csv(name)[no-heading]" > controller-nodes.txt
  gcloud compute instances list --filter="tags.items=kubernetes-the-hard-way AND tags.items=worker" --format="csv(name)[no-heading]" >  worker-nodes.txt
#+end_src

#+RESULTS:
#+begin_example
NAME             ZONE        MACHINE_TYPE   PREEMPTIBLE  INTERNAL_IP  EXTERNAL_IP    STATUS
gg-controller-0  us-west2-c  n1-standard-4               10.240.0.10  34.94.56.188   RUNNING
gg-controller-1  us-west2-c  n1-standard-4               10.240.0.11  34.94.182.163  RUNNING
gg-controller-2  us-west2-c  n1-standard-4               10.240.0.12  35.235.77.77   RUNNING
gg-worker-0      us-west2-c  n1-standard-8               10.240.0.20  35.236.1.139   RUNNING
gg-worker-1      us-west2-c  n1-standard-8               10.240.0.21  35.236.93.211  RUNNING
gg-worker-2      us-west2-c  n1-standard-8               10.240.0.22  34.94.175.154  RUNNING
gg-worker-3      us-west2-c  n1-standard-8               10.240.0.23  34.94.206.98   RUNNING
gg-worker-4      us-west2-c  n1-standard-8               10.240.0.24  35.236.113.11  RUNNING
gg-worker-5      us-west2-c  n1-standard-8               10.240.0.25  34.94.241.86   RUNNING
#+end_example


*** Generate the CA private key
  #+begin_src sh :session k-sh :results output replace :tangle cluster-setup/bin/10-create-ca-tls.sh
  cfssl gencert -initca ca-csr.json | cfssljson -bare ca
  #+end_src

  #+RESULTS:
  : 2020/01/30 18:19:15 [INFO] generating a new CA key and certificate from CSR
  : 2020/01/30 18:19:15 [INFO] generate received request
  : 2020/01/30 18:19:15 [INFO] received CSR
  : 2020/01/30 18:19:15 [INFO] generating key: rsa-2048
  : 2020/01/30 18:19:15 [INFO] encoded CSR
  : 2020/01/30 18:19:15 [INFO] signed certificate with serial number 326109283798148581868257693029050313468733725967


Results:

#+begin_example
  ca-key.pem
  ca.pem
#+end_example

*** The Admin Client Certificate
    :PROPERTIES:
    :CUSTOM_ID: the-admin-client-certificate
	:ID:       7cfbb6ff-c423-4223-b445-284d6d37ae69
    :END:

Generate the =admin= client certificate and private key:

#+begin_src json :tangle cluster-setup/admin-csr.json
  {
    "CN": "admin",
    "key": {
      "algo": "rsa",
      "size": 2048
    },
    "names": [
      {
        "C": "US",
        "L": "Portland",
        "O": "system:masters",
        "OU": "Kubernetes The Hard Way",
        "ST": "Oregon"
      }
    ]
  }
#+end_src
#+begin_src sh :session k-sh :results output replace :tangle cluster-setup/bin/10-create-ca-tls.sh
  cfssl gencert \
    -ca=ca.pem \
    -ca-key=ca-key.pem \
    -config=ca-config.json \
    -profile=kubernetes \
    admin-csr.json | cfssljson -bare admin
#+end_src

#+RESULTS:
#+begin_example

> > > > 2020/01/30 18:20:20 [INFO] generate received request
2020/01/30 18:20:20 [INFO] received CSR
2020/01/30 18:20:20 [INFO] generating key: rsa-2048
2020/01/30 18:20:20 [INFO] encoded CSR
2020/01/30 18:20:20 [INFO] signed certificate with serial number 694752539738889002895580162350206280383431605579
2020/01/30 18:20:20 [WARNING] This certificate lacks a "hosts" field. This makes it unsuitable for
websites. For more information see the Baseline Requirements for the Issuance and Management
of Publicly-Trusted Certificates, v.1.1.6, from the CA/Browser Forum (https://cabforum.org);
specifically, section 10.2.3 ("Information Requirements").
#+end_example

Results:

#+begin_example
  admin-key.pem
  admin.pem
#+end_example

*** The Kubelet Client Certificates
    :PROPERTIES:
    :CUSTOM_ID: the-kubelet-client-certificates
    :END:

Kubernetes uses a [[https://kubernetes.io/docs/admin/authorization/node/][special-purpose authorization mode]] called Node Authorizer, that
specifically authorizes API requests made by [[https://kubernetes.io/docs/concepts/overview/components/#kubelet][Kubelets]]. In order to be authorized by the
Node Authorizer, Kubelets must use a credential that identifies them as being in the
=system:nodes= group, with a username of =system:node:<nodeName>=. In this section you
will create a certificate for each Kubernetes worker node that meets the Node Authorizer
requirements.

Generate a certificate and private key for each Kubernetes worker node:

#+begin_src sh :session k-sh :results output replace :tangle cluster-setup/bin/10-create-ca-tls.sh
  for instance in $(gcloud compute instances list --filter="tags.items=kubernetes-the-hard-way AND tags.items=worker" --format="csv(name)[no-heading]") ; do
	  # for instance in worker-0 worker-1 worker-2; do
	  cat > ${instance}-csr.json <<EOF
	{
	  "CN": "system:node:${instance}",
	  "key": {
		"algo": "rsa",
		"size": 2048
	  },
	  "names": [
		{
		  "C": "US",
		  "L": "Portland",
		  "O": "system:nodes",
		  "OU": "Kubernetes The Hard Way",
		  "ST": "Oregon"
		}
	  ]
	}
  EOF

	  EXTERNAL_IP=$(gcloud compute instances describe ${instance} \
						   --format 'value(networkInterfaces[0].accessConfigs[0].natIP)')

	  INTERNAL_IP=$(gcloud compute instances describe ${instance} \
						   --format 'value(networkInterfaces[0].networkIP)')

	  cfssl gencert \
			-ca=ca.pem \
			-ca-key=ca-key.pem \
			-config=ca-config.json \
			-hostname=${instance},${EXTERNAL_IP},${INTERNAL_IP} \
			-profile=kubernetes \
			${instance}-csr.json | cfssljson -bare ${instance}
  done
#+end_src

#+RESULTS:
#+begin_example

> > > > > > > > > > > > > > > > > > > > > > > > > > > > > > > > > 2020/01/30 18:22:26 [INFO] generate received request
2020/01/30 18:22:26 [INFO] received CSR
2020/01/30 18:22:26 [INFO] generating key: rsa-2048
2020/01/30 18:22:26 [INFO] encoded CSR
2020/01/30 18:22:26 [INFO] signed certificate with serial number 473484522229049968362340782306096064505321277339
2020/01/30 18:22:28 [INFO] generate received request
2020/01/30 18:22:28 [INFO] received CSR
2020/01/30 18:22:28 [INFO] generating key: rsa-2048
2020/01/30 18:22:28 [INFO] encoded CSR
2020/01/30 18:22:28 [INFO] signed certificate with serial number 562934390978428096753224319637248738468080761775
2020/01/30 18:22:30 [INFO] generate received request
2020/01/30 18:22:30 [INFO] received CSR
2020/01/30 18:22:30 [INFO] generating key: rsa-2048
2020/01/30 18:22:30 [INFO] encoded CSR
2020/01/30 18:22:30 [INFO] signed certificate with serial number 526568955769868315991499574786126575152353700803
2020/01/30 18:22:33 [INFO] generate received request
2020/01/30 18:22:33 [INFO] received CSR
2020/01/30 18:22:33 [INFO] generating key: rsa-2048
2020/01/30 18:22:33 [INFO] encoded CSR
2020/01/30 18:22:33 [INFO] signed certificate with serial number 545277841309318275487127096477581750507205169878
2020/01/30 18:22:35 [INFO] generate received request
2020/01/30 18:22:35 [INFO] received CSR
2020/01/30 18:22:35 [INFO] generating key: rsa-2048
2020/01/30 18:22:35 [INFO] encoded CSR
2020/01/30 18:22:35 [INFO] signed certificate with serial number 578977280501839381193408740188769636629784260588
2020/01/30 18:22:37 [INFO] generate received request
2020/01/30 18:22:37 [INFO] received CSR
2020/01/30 18:22:37 [INFO] generating key: rsa-2048
2020/01/30 18:22:38 [INFO] encoded CSR
2020/01/30 18:22:38 [INFO] signed certificate with serial number 294447578788068523265445278147407137156662195808
#+end_example

Results:

#+begin_example
  worker-0-key.pem
  worker-0.pem
  worker-1-key.pem
  worker-1.pem
  worker-2-key.pem
  worker-2.pem
#+end_example

*** The Controller Manager Client Certificate
    :PROPERTIES:
    :CUSTOM_ID: the-controller-manager-client-certificate
    :END:

Generate the =kube-controller-manager= client certificate and private key:

#+begin_src json :tangle cluster-setup/kube-controller-manager-csr.json
  {
    "CN": "system:kube-controller-manager",
    "key": {
      "algo": "rsa",
      "size": 2048
    },
    "names": [
      {
        "C": "US",
        "L": "Portland",
        "O": "system:kube-controller-manager",
        "OU": "Kubernetes The Hard Way",
        "ST": "Oregon"
      }
    ]
  }
#+end_src

  #+begin_src sh :session k-sh :results output replace :tangle cluster-setup/bin/10-create-ca-tls.sh
  cfssl gencert \
    -ca=ca.pem \
    -ca-key=ca-key.pem \
    -config=ca-config.json \
    -profile=kubernetes \
    kube-controller-manager-csr.json | cfssljson -bare kube-controller-manager
  #+end_src

  #+RESULTS:
  #+begin_example

  > > > > 2020/01/30 18:23:34 [INFO] generate received request
  2020/01/30 18:23:34 [INFO] received CSR
  2020/01/30 18:23:34 [INFO] generating key: rsa-2048
  2020/01/30 18:23:35 [INFO] encoded CSR
  2020/01/30 18:23:35 [INFO] signed certificate with serial number 397689001734826482803123209592657855342472802460
  2020/01/30 18:23:35 [WARNING] This certificate lacks a "hosts" field. This makes it unsuitable for
  websites. For more information see the Baseline Requirements for the Issuance and Management
  of Publicly-Trusted Certificates, v.1.1.6, from the CA/Browser Forum (https://cabforum.org);
  specifically, section 10.2.3 ("Information Requirements").
  #+end_example

Results:

#+begin_example
  kube-controller-manager-key.pem
  kube-controller-manager.pem
#+end_example

*** The Kube Proxy Client Certificate
    :PROPERTIES:
    :CUSTOM_ID: the-kube-proxy-client-certificate
    :END:

Generate the =kube-proxy= client certificate and private key:

#+begin_src json :tangle cluster-setup/kube-proxy-csr.json
  {
    "CN": "system:kube-proxy",
    "key": {
      "algo": "rsa",
      "size": 2048
    },
    "names": [
      {
        "C": "US",
        "L": "Portland",
        "O": "system:node-proxier",
        "OU": "Kubernetes The Hard Way",
        "ST": "Oregon"
      }
    ]
  }
#+end_src

  #+begin_src sh :session k-sh :results output replace :tangle cluster-setup/bin/10-create-ca-tls.sh
  cfssl gencert \
    -ca=ca.pem \
    -ca-key=ca-key.pem \
    -config=ca-config.json \
    -profile=kubernetes \
    kube-proxy-csr.json | cfssljson -bare kube-proxy
  #+end_src

  #+RESULTS:
  #+begin_example

  > > > > 2020/01/30 18:24:15 [INFO] generate received request
  2020/01/30 18:24:15 [INFO] received CSR
  2020/01/30 18:24:15 [INFO] generating key: rsa-2048
  2020/01/30 18:24:15 [INFO] encoded CSR
  2020/01/30 18:24:15 [INFO] signed certificate with serial number 131379959267205102685475078166597487822199387441
  2020/01/30 18:24:15 [WARNING] This certificate lacks a "hosts" field. This makes it unsuitable for
  websites. For more information see the Baseline Requirements for the Issuance and Management
  of Publicly-Trusted Certificates, v.1.1.6, from the CA/Browser Forum (https://cabforum.org);
  specifically, section 10.2.3 ("Information Requirements").
  #+end_example


Results:

#+begin_example
  kube-proxy-key.pem
  kube-proxy.pem
#+end_example

*** The Scheduler Client Certificate
    :PROPERTIES:
    :CUSTOM_ID: the-scheduler-client-certificate
    :END:

Generate the =kube-scheduler= client certificate and private key:

#+begin_src json :tangle cluster-setup/kube-scheduler-csr.json
  {
    "CN": "system:kube-scheduler",
    "key": {
      "algo": "rsa",
      "size": 2048
    },
    "names": [
      {
        "C": "US",
        "L": "Portland",
        "O": "system:kube-scheduler",
        "OU": "Kubernetes The Hard Way",
        "ST": "Oregon"
      }
    ]
  }
#+end_src

  #+begin_src sh :session k-sh :results output replace :tangle cluster-setup/bin/10-create-ca-tls.sh
  cfssl gencert \
    -ca=ca.pem \
    -ca-key=ca-key.pem \
    -config=ca-config.json \
    -profile=kubernetes \
    kube-scheduler-csr.json | cfssljson -bare kube-scheduler
  #+end_src

  #+RESULTS:
  #+begin_example

  > > > > 2020/01/30 18:24:57 [INFO] generate received request
  2020/01/30 18:24:57 [INFO] received CSR
  2020/01/30 18:24:57 [INFO] generating key: rsa-2048
  2020/01/30 18:24:57 [INFO] encoded CSR
  2020/01/30 18:24:57 [INFO] signed certificate with serial number 268366538692953441553168215244898344789985941087
  2020/01/30 18:24:57 [WARNING] This certificate lacks a "hosts" field. This makes it unsuitable for
  websites. For more information see the Baseline Requirements for the Issuance and Management
  of Publicly-Trusted Certificates, v.1.1.6, from the CA/Browser Forum (https://cabforum.org);
  specifically, section 10.2.3 ("Information Requirements").
  #+end_example


Results:

#+begin_example
  kube-scheduler-key.pem
  kube-scheduler.pem
#+end_example

** The Service Account Key Pair
   :PROPERTIES:
   :CUSTOM_ID: the-service-account-key-pair
   :END:

The Kubernetes Controller Manager leverages a key pair to generate and sign service account tokens as described in the [[https://kubernetes.io/docs/admin/service-accounts-admin/][managing service accounts]] documentation.

Generate the =service-account= certificate and private key:

#+begin_src json :tangle cluster-setup/service-account-csr.json
  {
    "CN": "service-accounts",
    "key": {
      "algo": "rsa",
      "size": 2048
    },
    "names": [
      {
        "C": "US",
        "L": "Portland",
        "O": "Kubernetes",
        "OU": "Kubernetes The Hard Way",
        "ST": "Oregon"
      }
    ]
  }
#+end_src

  #+begin_src sh :session k-sh :results output replace :tangle cluster-setup/bin/10-create-ca-tls.sh
  cfssl gencert \
    -ca=ca.pem \
    -ca-key=ca-key.pem \
    -config=ca-config.json \
    -profile=kubernetes \
    service-account-csr.json | cfssljson -bare service-account
  #+end_src

  #+RESULTS:
  #+begin_example

  > > > > 2020/01/30 18:28:30 [INFO] generate received request
  2020/01/30 18:28:30 [INFO] received CSR
  2020/01/30 18:28:30 [INFO] generating key: rsa-2048
  2020/01/30 18:28:31 [INFO] encoded CSR
  2020/01/30 18:28:31 [INFO] signed certificate with serial number 72423385797912090426753734597164879583350805877
  2020/01/30 18:28:31 [WARNING] This certificate lacks a "hosts" field. This makes it unsuitable for
  websites. For more information see the Baseline Requirements for the Issuance and Management
  of Publicly-Trusted Certificates, v.1.1.6, from the CA/Browser Forum (https://cabforum.org);
  specifically, section 10.2.3 ("Information Requirements").
  #+end_example

Results:

#+begin_example
  service-account-key.pem
  service-account.pem
#+end_example

** Distribute the Client and Server Certificates
   :PROPERTIES:
   :CUSTOM_ID: distribute-the-client-and-server-certificates
   :END:

Copy the appropriate certificates and private keys to each worker instance:

#+begin_src sh :session k-sh :results output replace :tangle cluster-setup/bin/10-create-ca-tls.sh
  for instance in $(gcloud compute instances list --filter="tags.items=kubernetes-the-hard-way AND tags.items=worker" --format="csv(name)[no-heading]") ; do
  # for instance in worker-0 worker-1 worker-2; do
	gcloud compute scp ca.pem ${instance}-key.pem ${instance}.pem ${instance}:~/
  done
#+end_src

#+RESULTS:
#+begin_example

> > Warning: Permanently added 'compute.4148932938305552459' (ECDSA) to the list of known hosts.
0     0.0KB/s   --:-- ETAca.pem                                                                                                      100% 1318    29.1KB/s   00:00
0     0.0KB/s   --:-- ETAgg-worker-0-key.pem                                                                                         100% 1679    34.2KB/s   00:00
0     0.0KB/s   --:-- ETAgg-worker-0.pem                                                                                             100% 1501    31.1KB/s   00:00    
Warning: Permanently added 'compute.3687660481576616008' (ECDSA) to the list of known hosts.
0     0.0KB/s   --:-- ETAca.pem                                                                                                      100% 1318    26.2KB/s   00:00
0     0.0KB/s   --:-- ETAgg-worker-1-key.pem                                                                                         100% 1675    35.1KB/s   00:00
0     0.0KB/s   --:-- ETAgg-worker-1.pem                                                                                             100% 1501    33.0KB/s   00:00    
Warning: Permanently added 'compute.8805661202184060997' (ECDSA) to the list of known hosts.
0     0.0KB/s   --:-- ETAca.pem                                                                                                      100% 1318    27.1KB/s   00:00
0     0.0KB/s   --:-- ETAgg-worker-2-key.pem                                                                                         100% 1679    34.7KB/s   00:00
0     0.0KB/s   --:-- ETAgg-worker-2.pem                                                                                             100% 1501    29.5KB/s   00:00    
Warning: Permanently added 'compute.231301956895686723' (ECDSA) to the list of known hosts.
0     0.0KB/s   --:-- ETAca.pem                                                                                                      100% 1318    25.4KB/s   00:00
0     0.0KB/s   --:-- ETAgg-worker-3-key.pem                                                                                         100% 1675    33.2KB/s   00:00
0     0.0KB/s   --:-- ETAgg-worker-3.pem                                                                                             100% 1501    32.4KB/s   00:00    
Warning: Permanently added 'compute.6503439108098932831' (ECDSA) to the list of known hosts.
0     0.0KB/s   --:-- ETAca.pem                                                                                                      100% 1318    23.0KB/s   00:00
0     0.0KB/s   --:-- ETAgg-worker-4-key.pem                                                                                         100% 1675    36.3KB/s   00:00
0     0.0KB/s   --:-- ETAgg-worker-4.pem                                                                                             100% 1501    31.3KB/s   00:00    
Warning: Permanently added 'compute.8110333274298957917' (ECDSA) to the list of known hosts.
0     0.0KB/s   --:-- ETAca.pem                                                                                                      100% 1318    27.6KB/s   00:00
0     0.0KB/s   --:-- ETAgg-worker-5-key.pem                                                                                         100% 1675    34.5KB/s   00:00
0     0.0KB/s   --:-- ETAgg-worker-5.pem                                                                                             100% 1501    31.9KB/s   00:00
#+end_example

Copy the appropriate certificates and private keys to each controller instance:

#+begin_src sh :session k-sh :results output replace :tangle cluster-setup/bin/10-create-ca-tls.sh
  for instance in $(gcloud compute instances list --filter="tags.items=kubernetes-the-hard-way AND tags.items=controller" --format="csv(name)[no-heading]") ; do
	gcloud compute scp ca.pem ca-key.pem kubernetes-key.pem kubernetes.pem \
	  service-account-key.pem service-account.pem ${instance}:~/
  done
#+end_src

#+RESULTS:
#+begin_example

> > > ca.pem                                                                                                        0%    0     0.0KB/s   --:-- ETAca.pem                                                                                                      100% 1318    29.0KB/s   00:00
0     0.0KB/s   --:-- ETAca-key.pem                                                                                                  100% 1675    36.8KB/s   00:00
0     0.0KB/s   --:-- ETAkubernetes-key.pem                                                                                          100% 1675    34.7KB/s   00:00
0     0.0KB/s   --:-- ETAkubernetes.pem                                                                                              100% 1663    35.3KB/s   00:00
0     0.0KB/s   --:-- ETAservice-account-key.pem                                                                                     100% 1675    32.7KB/s   00:00
0     0.0KB/s   --:-- ETAservice-account.pem                                                                                         100% 1440    29.4KB/s   00:00    
Warning: Permanently added 'compute.4813470868415889610' (ECDSA) to the list of known hosts.
0     0.0KB/s   --:-- ETAca.pem                                                                                                      100% 1318    28.1KB/s   00:00
0     0.0KB/s   --:-- ETAca-key.pem                                                                                                  100% 1675    36.3KB/s   00:00
0     0.0KB/s   --:-- ETAkubernetes-key.pem                                                                                          100% 1675    33.4KB/s   00:00
0     0.0KB/s   --:-- ETAkubernetes.pem                                                                                              100% 1663    35.9KB/s   00:00
0     0.0KB/s   --:-- ETAservice-account-key.pem                                                                                     100% 1675    34.3KB/s   00:00
0     0.0KB/s   --:-- ETAservice-account.pem                                                                                         100% 1440    29.4KB/s   00:00    
Warning: Permanently added 'compute.2740873625943851208' (ECDSA) to the list of known hosts.
0     0.0KB/s   --:-- ETAca.pem                                                                                                      100% 1318    27.5KB/s   00:00
0     0.0KB/s   --:-- ETAca-key.pem                                                                                                  100% 1675    34.1KB/s   00:00
0     0.0KB/s   --:-- ETAkubernetes-key.pem                                                                                          100% 1675    35.9KB/s   00:00
0     0.0KB/s   --:-- ETAkubernetes.pem                                                                                              100% 1663    35.2KB/s   00:00
0     0.0KB/s   --:-- ETAservice-account-key.pem                                                                                     100% 1675    33.4KB/s   00:00
0     0.0KB/s   --:-- ETAservice-account.pem                                                                                         100% 1440    30.0KB/s   00:00
#+end_example

#+begin_quote
  The =kube-proxy=, =kube-controller-manager=, =kube-scheduler=, and =kubelet= client certificates will be used to generate client authentication configuration files in the next lab.
#+end_quote

Next: [[file:05-kubernetes-configuration-files.md][Generating Kubernetes Configuration Files for Authentication]]
**** Install =pdsh= on all controller and worker instances
#+begin_src sh :session k-sh :results output replace :tangle no
  for instance in $(gcloud compute instances list --filter="tags.items=kubernetes-the-hard-way" --format="csv(name)[no-heading]") ; do
	  gcloud compute ssh ${instance} --command "sudo apt update && sudo apt -y install pdsh"
  done
#+end_src

#+RESULTS:
#+begin_example

> Ohai gg-controller-0
Ohai gg-controller-1
Ohai gg-controller-2
Ohai gg-worker-0
Ohai gg-worker-1
Ohai gg-worker-2
Ohai gg-worker-3
Ohai gg-worker-4
Ohai gg-worker-5
#+end_example

Once you do the step below, your =k-sh= shell session will be controlling the bastion
host, and you can simply execute the commands in the rest of this lab in that session.
**** Connect to one of the cluster nodes and prepare as bastion host
#+begin_src sh :session k-sh :results output replace :tangle no
  gcloud compute instances list --filter="tags.items=kubernetes-the-hard-way AND tags.items=controller" --format="csv(name)[no-heading]" > controller-nodes.txt
  gcloud compute instances list --filter="tags.items=kubernetes-the-hard-way AND tags.items=worker" --format="csv(name)[no-heading]" > worker-nodes.txt
  BASTION_HOST=$(head -1 controller-nodes.txt)
  gcloud compute scp controller-nodes.txt ${BASTION_HOST}:~/
  gcloud compute ssh --zone $(gcloud config get-value compute/zone) ${BASTION_HOST} 
#+end_src

#+RESULTS:
#+begin_example

▶  ~ ❯ projects ❯ … ❯ cluster-setup ▶  gregoryg ▶ $ ▶  ~ ❯ projects ❯ … ❯ cluster-setup ▶  gregoryg ▶ $ ▶ External IP address was not found; defaulting to using IAP tunneling.
0     0.0KB/s   --:-- ETAcontroller-nodes.txt                                                                                        100%   48     0.7KB/s   00:00
▶ External IP address was not found; defaulting to using IAP tunneling.
Welcome to Ubuntu 18.04.3 LTS (GNU/Linux 5.0.0-1029-gcp x86_64)

 ,* Documentation:  https://help.ubuntu.com
 ,* Management:     https://landscape.canonical.com
 ,* Support:        https://ubuntu.com/advantage

  System information as of Sat Feb  1 01:48:25 UTC 2020

  System load:  0.0                Processes:           126
of 193.66GB   Users logged in:     0
IP address for ens4: 10.240.0.10
5 packages can be updated.
0 updates are security updates.


Last login: Sat Feb  1 01:44:39 2020 from 35.235.240.0
#+end_example
*** Create the =etcd.service= systemd unit file:
#+begin_src sh :session k-sh :results output replace :tangle cluster-setup/bin/40-bootstrap-etcd.sh
  cat <<EOF | sudo tee /etc/systemd/system/etcd.service
  [Unit]
  Description=etcd
  Documentation=https://github.com/coreos

  [Service]
  Type=notify
  ExecStart=/usr/local/bin/etcd \\
	--name ${ETCD_NAME} \\
	--cert-file=/etc/etcd/kubernetes.pem \\
	--key-file=/etc/etcd/kubernetes-key.pem \\
	--peer-cert-file=/etc/etcd/kubernetes.pem \\
	--peer-key-file=/etc/etcd/kubernetes-key.pem \\
	--trusted-ca-file=/etc/etcd/ca.pem \\
	--peer-trusted-ca-file=/etc/etcd/ca.pem \\
	--peer-client-cert-auth \\
	--client-cert-auth \\
	--initial-advertise-peer-urls https://${INTERNAL_IP}:2380 \\
	--listen-peer-urls https://${INTERNAL_IP}:2380 \\
	--listen-client-urls https://${INTERNAL_IP}:2379,https://127.0.0.1:2379 \\
	--advertise-client-urls https://${INTERNAL_IP}:2379 \\
	--initial-cluster-token etcd-cluster-0 \\
	--initial-cluster gg-controller-0=https://10.240.0.10:2380,gg-controller-1=https://10.240.0.11:2380,gg-controller-2=https://10.240.0.12:2380 \\
	--initial-cluster-state new \\
	--data-dir=/var/lib/etcd
  Restart=on-failure
  RestartSec=5

  [Install]
  WantedBy=multi-user.target
  EOF
#+end_src

#+RESULTS:
#+begin_example

> > > > > > > > > > > > > > > > > > > > > > > > > > > > > [Unit]
Description=etcd
Documentation=https://github.com/coreos

[Service]
Type=notify
ExecStart=/usr/local/bin/etcd \
  --name gg-controller-0 \
  --cert-file=/etc/etcd/kubernetes.pem \
  --key-file=/etc/etcd/kubernetes-key.pem \
  --peer-cert-file=/etc/etcd/kubernetes.pem \
  --peer-key-file=/etc/etcd/kubernetes-key.pem \
  --trusted-ca-file=/etc/etcd/ca.pem \
  --peer-trusted-ca-file=/etc/etcd/ca.pem \
  --peer-client-cert-auth \
  --client-cert-auth \
  --initial-advertise-peer-urls https://10.240.0.10:2380 \
  --listen-peer-urls https://10.240.0.10:2380 \
  --listen-client-urls https://10.240.0.10:2379,https://127.0.0.1:2379 \
  --advertise-client-urls https://10.240.0.10:2379 \
  --initial-cluster-token etcd-cluster-0 \
  --initial-cluster gg-controller-0=https://10.240.0.10:2380,gg-controller-1=https://10.240.0.11:2380,gg-controller-2=https://10.240.0.12:2380 \
  --initial-cluster-state new \
  --data-dir=/var/lib/etcd
Restart=on-failure
RestartSec=5

[Install]
WantedBy=multi-user.target
#+end_example

